CiscoDevNet/csmp-agent-lib/efr32_wisun/gecko_sdk_2024.6.0/platform/service/iostream/src/sl_iostream_uart.c
  uint32_t i = 0;
  while (i < buffer_length) {
    bool xon = false;
    if (uart_context->sw_flow_control == true) {
      CORE_ENTER_ATOMIC();
      scan_for_ctrl_char(uart_context);
      CORE_EXIT_ATOMIC();
    }
    sl_atomic_load(xon, uart_context->xon);
    if (xon) {
      if (lf_to_crlf == true) {
        if (*c == '\n') {
          status = uart_context->tx(uart_context, '\r');
        }
      }
      status = uart_context->tx(uart_context, *c);
      if (status != SL_STATUS_OK) {
        return status;
      }
      c++;
      i++;
    }         // Active wait if xon is false
  }

#if defined(SL_CATALOG_POWER_MANAGER_PRESENT) && !defined(SL_IOSTREAM_UART_FLUSH_TX_BUFFER)
  uart_context->tx_completed(context, true);
#endif

  return status;
}

/***************************************************************************//**
 * Internal stream write implementation
 ******************************************************************************/
static sl_status_t uart_write(void *context,
                              const void *buffer,
                              size_t buffer_length)
{
#if (defined(SL_CATALOG_KERNEL_PRESENT))
  osStatus_t status;
  sl_iostream_uart_context_t *uart_context = (sl_iostream_uart_context_t *)context;
  if (osKernelGetState() == osKernelRunning) {
    // Bypass lock if we print before the kernel is running
    status = osMutexAcquire(uart_context->write_lock, osWaitForever);

    if (status != osOK) {
      return SL_STATUS_INVALID_STATE;       // Can happen if a task deinit and another try to write at sametime
    }
  }
#endif

  nolock_uart_write(context, buffer, buffer_length);

#if (defined(SL_CATALOG_KERNEL_PRESENT))
  if (osKernelGetState() == osKernelRunning) {
    // Bypass lock if we print before the kernel is running
    status = osMutexRelease(uart_context->write_lock);
    EFM_ASSERT(status == osOK);
  }
#endif
  return SL_STATUS_OK;
}

/***************************************************************************//**
 * Internal stream read implementation
 ******************************************************************************/
static sl_status_t uart_read(void *context,
                             void *buffer,
                             size_t buffer_length,
                             size_t *bytes_read)
{
  CORE_DECLARE_IRQ_STATE;
  sl_iostream_uart_context_t *uart_context = (sl_iostream_uart_context_t *)context;

   #if (defined(SL_CATALOG_KERNEL_PRESENT))
  osStatus_t status;
  if (osKernelGetState() == osKernelRunning) {
    // Bypass lock if we print before the kernel is running
    status = osMutexAcquire(uart_context->read_lock, osWaitForever);

    if (status != osOK) {
      return SL_STATUS_INVALID_STATE;   // Can happen if a task deinit and another try to read at sametime
    }

    if (uart_context->block) {
      EFM_ASSERT(osSemaphoreAcquire(uart_context->read_signal, osWaitForever) == osOK);
    }
  }
  #endif

  CORE_ENTER_ATOMIC();
  *bytes_read = read_rx_buffer(uart_context, (uint8_t *) buffer, (size_t)buffer_length);
  CORE_EXIT_ATOMIC();

  #if (defined(SL_CATALOG_KERNEL_PRESENT))
  if (osKernelGetState() == osKernelRunning) {
    // Bypass lock if we print before the kernel is running
    EFM_ASSERT(osMutexRelease(uart_context->read_lock) == osOK);
  }
  #endif

  if (*bytes_read == 0) {
    return SL_STATUS_EMPTY;
  } else {
    return SL_STATUS_OK;
  }
}

/***************************************************************************//**
 * Updates the (L)DMA to re-use whatever space is in the ring buffer.
 * Always returns false (no loop, check DMADRV IRQ callbacks documentation
 * for more details).
 ******************************************************************************/
static bool dma_irq_handler(unsigned int chan, unsigned int seq, void* user_param)
{
  (void) seq;
  sl_iostream_uart_context_t *uart_context = (sl_iostream_uart_context_t *)user_param;
  uint8_t *write_ptr;
  Ecode_t ecode;
  size_t available_space;

  // Compute next write position
  {
    // DMA is stopped, no need to pause before calling get_write_ptr()
    write_ptr = get_write_ptr(uart_context);
  }

  // Compute available space
  if (uart_context->rx_read_ptr >= write_ptr) {
    available_space = (size_t)(uart_context->rx_read_ptr - write_ptr);
  } else {
    available_space = (size_t)((uart_context->rx_buffer + uart_context->rx_buffer_len) - write_ptr);
  }

  // Space available in the RX buffer
  if (available_space > 0) {
    // Start the DMA transfer
    ecode = DMADRV_PeripheralMemory(chan,
                                    uart_context->dma.cfg.peripheral_signal,
                                    write_ptr,
                                    uart_context->dma.cfg.src,
                                    true,
                                    available_space,
                                    dmadrvDataSize1,
                                    dma_irq_handler,
                                    uart_context);
    EFM_ASSERT(ecode == ECODE_OK);
  }
  // RX buffer is full
  else {
    uart_context->rx_buffer_full = true;

    // Send first XOFF. Subsequent XOFFs will be sent by the stream's IRQ handler.
    if (uart_context->sw_flow_control) {
      sl_atomic_store(uart_context->remote_xon, false);
      uart_context->tx(uart_context, UARTXOFF);
      // Enable the RXDATAV IRQ to check if we receive a control character when buffer is full
      uart_context->set_next_byte_detect(uart_context);
    }
  }
  return false;
}

/***************************************************************************//**
 * Get the next byte to be written to by the (L)DMA.
 * When using a non-linked DMA, you should pause the DMA before calling to ensure
 * the validity of the result.
 ******************************************************************************/
__STATIC_INLINE uint8_t* get_write_ptr(const sl_iostream_uart_context_t * uart_context)
{
  uint8_t* dst;

  #if defined(DMA_PRESENT)
  int remaining;
  Ecode_t ecode;
  ecode = DMADRV_TransferRemainingCount(uart_context->dma.channel, &remaining);
  EFM_ASSERT(ecode == ECODE_OK);

  DMA_DESCRIPTOR_TypeDef* desc = ((DMA_DESCRIPTOR_TypeDef *)(DMA->CTRLBASE)) + uart_context->dma.channel;
  dst = ((uint8_t*)desc->DSTEND + 1) - remaining;

  #elif defined(LDMA_PRESENT)
  dst = (uint8_t *)LDMA_PERIPH->CH[uart_context->dma.channel].DST;
  #endif

  // Check for buffer over/underflow
  EFM_ASSERT(dst <= (uart_context->rx_buffer + uart_context->rx_buffer_len)
             && dst >= uart_context->rx_buffer);

  // Wrap dst around
  if (dst == (uart_context->rx_buffer + uart_context->rx_buffer_len)) {
    dst = uart_context->rx_buffer;
  }

