CiscoDevNet/csmp-agent-lib/efr32_wisun/gecko_sdk_2024.6.0/platform/service/iostream/src/sl_iostream_uart.c
  return dst;
}

/***************************************************************************//**
 * Update ring buffer pointers and DMA descriptor.
 ******************************************************************************/
static void update_ring_buffer(sl_iostream_uart_context_t * uart_context)
{
  Ecode_t ecode;
  bool dma_done, irq_pending;
  uint8_t *write_ptr;

  // Made space in the buffer by reading
  uart_context->rx_buffer_full = false;

  // Pause the DMA to update
  ecode = DMADRV_PauseTransfer(uart_context->dma.channel);
  EFM_ASSERT(ecode == ECODE_OK);

  // Get next byte to be written by DMA
  write_ptr = get_write_ptr(uart_context);

  // All data has been read, reset the DMA to re-use all the buffer
  if (write_ptr == uart_context->rx_read_ptr) {
    // Reset DMA to the start of the UART Rx Buffer and all control pointers
    uart_context->rx_data_available = false;
    write_ptr = uart_context->rx_buffer;
    uart_context->rx_read_ptr = write_ptr;
    if (uart_context->sw_flow_control) {
      uart_context->ctrl_char_scan_ptr = uart_context->rx_read_ptr;
    }

    // Enable RXDATAV IRQ to signal next incoming byte
    uart_context->set_next_byte_detect(uart_context);

    // Start new transfer for all rx_buffer
    ecode = DMADRV_PeripheralMemory(uart_context->dma.channel,
                                    uart_context->dma.cfg.peripheral_signal,
                                    write_ptr,
                                    uart_context->dma.cfg.src,
                                    true,
                                    uart_context->rx_buffer_len,
                                    dmadrvDataSize1,
                                    dma_irq_handler,
                                    uart_context);
    EFM_ASSERT(ecode == ECODE_OK);
  }
  // Data still available in buffer
  else {
    uart_context->rx_data_available = true;

    // Unlock read (only in Kernel)
    #if defined(SL_CATALOG_KERNEL_PRESENT)
    if (uart_context->block) {
      EFM_ASSERT(uart_context->rx_data_available);     // Should always be data available here
      if (osSemaphoreGetCount(uart_context->read_signal) == 0) {
        osStatus_t status = osSemaphoreRelease(uart_context->read_signal);
        EFM_ASSERT(status == osOK);
      }
    }
    #endif // SL_CATALOG_KERNEL_PRESENT

    // Check if DMA is still active
    ecode = DMADRV_TransferDone(uart_context->dma.channel, &dma_done);
    EFM_ASSERT(ecode == ECODE_OK);

    // DMA stopped because it was full
    if (dma_done) {
      // Check if IRQ is pending
      ecode = DMADRV_TransferCompletePending(uart_context->dma.channel, &irq_pending);
      EFM_ASSERT(ecode == ECODE_OK);

      // No IRQ pending
      if (irq_pending == false) {
        // Call IRQ handler to start a new transfer over available space
        dma_irq_handler(uart_context->dma.channel, 0, uart_context);
      }
    }
  }
  // Resume DMA
  ecode = DMADRV_ResumeTransfer(uart_context->dma.channel);
  EFM_ASSERT(ecode == ECODE_OK);
}

/***************************************************************************//**
 * Tries to read the requested amount of data.
 * Returns the number of bytes read.
 ******************************************************************************/
static size_t read_rx_buffer(sl_iostream_uart_context_t * uart_context,
                             uint8_t * buffer,
                             size_t buffer_len)
{
  if (buffer_len == 0) {
    return 0;
  }

  if (uart_context->rx_data_available == false) {
    #if defined(SL_CATALOG_KERNEL_PRESENT)
    if (uart_context->block) {
      EFM_ASSERT(false);     // Should always have data in blocking mode
    }
    #endif
    return 0;
  }
  CORE_DECLARE_IRQ_STATE;

  uint8_t *write_ptr;     // Pointer to the next byte to be written by the (L)DMA
  size_t read_size = 0;     // Number of bytes processed from the Rx Buffer
  size_t ret_val = 0;     // Number of bytes written to the user buffer

  // Compute the read_size
  {
    #if defined(DMA_PRESENT)
    Ecode_t ecode;
    ecode = DMADRV_PauseTransfer(uart_context->dma.channel);
    EFM_ASSERT(ecode == ECODE_OK);
    #endif // DMA_PRESENT

    write_ptr = get_write_ptr(uart_context);

    #if defined(DMA_PRESENT)
    ecode = DMADRV_ResumeTransfer(uart_context->dma.channel);
    EFM_ASSERT(ecode == ECODE_OK);
    #endif // DMA_PRESENT

    if (write_ptr == uart_context->rx_read_ptr) {
      // (L)DMA is wrapped over rx_read_ptr, make sure it is stopped
      EFM_ASSERT(uart_context->rx_buffer_full == true);
    }

    // (L)DMA ahead of read ptr, read data in between the (L)DMA and the read ptr
    if (write_ptr > uart_context->rx_read_ptr) {
      read_size = write_ptr - uart_context->rx_read_ptr;
    }
    // (L)DMA wrapped around RX buffer, read data between read ptr and end of RX buffer
    else {
      read_size = (uart_context->rx_buffer + uart_context->rx_buffer_len) - uart_context->rx_read_ptr;
    }

    // read the smallest amount between the data available and the size of the user buffer
    read_size = buffer_len < read_size ? buffer_len : read_size;
  }

  // Number of bytes written to user buffer can be different if control character are present
  ret_val = read_size;

  // Read data
  {
    CORE_ENTER_ATOMIC();

    // Handle control character and copy data to the user buffer
    if (uart_context->sw_flow_control == true) {
      for (size_t bytes_read = 0; bytes_read < read_size; bytes_read++) {
        // Found control character, update xon
        if (*uart_context->rx_read_ptr == (uint8_t)UARTXON || *uart_context->rx_read_ptr == (uint8_t)UARTXOFF) {
          // Current byte is the most recent scanned byte. Apply control character
          if (uart_context->rx_read_ptr == uart_context->ctrl_char_scan_ptr) {
            sl_atomic_store(uart_context->xon, (*uart_context->rx_read_ptr == (uint8_t)UARTXON));
          }
          ret_val--;
        }
        // No control character, read data and increment user buffer
        else {
          *buffer++ = *uart_context->rx_read_ptr;
        }

        // Caught up to most recent scanned byte, increment the scan ptr
        if (uart_context->rx_read_ptr == uart_context->ctrl_char_scan_ptr) {
          uart_context->ctrl_char_scan_ptr++;
        }

        // Go to next byte
        uart_context->rx_read_ptr++;
      }

      // Wrap ctrl_char_scan_ptr around the rx_buffer
      if (uart_context->ctrl_char_scan_ptr == (uart_context->rx_buffer + uart_context->rx_buffer_len)) {
        uart_context->ctrl_char_scan_ptr = uart_context->rx_buffer;
      }

      EFM_ASSERT(uart_context->ctrl_char_scan_ptr >= uart_context->rx_buffer
                 && uart_context->ctrl_char_scan_ptr < (uart_context->rx_buffer + uart_context->rx_buffer_len));
    }
    // Copy the data to the output buffer
    else {
      memcpy(buffer, uart_context->rx_read_ptr, read_size);
      // Increment rx read ptr
      uart_context->rx_read_ptr += read_size;
    }

    // Wrap rx_read_ptr around
    if (uart_context->rx_read_ptr == (uart_context->rx_buffer + uart_context->rx_buffer_len)) {
      uart_context->rx_read_ptr = uart_context->rx_buffer;
    }

    // Sanity check
    EFM_ASSERT(uart_context->rx_read_ptr >= uart_context->rx_buffer
               && uart_context->rx_read_ptr < (uart_context->rx_buffer + uart_context->rx_buffer_len));
  }

  // Update the ring buffer after read
  update_ring_buffer(uart_context);
  CORE_EXIT_ATOMIC();

  return ret_val;
}
